// function pow(x,n)
// {
//   let result=1;
//   for(let i=0;i<n;i++) {result*=x;}
//   return result;
// }

// let x=prompt("x?",''), n=prompt("n?",'')
// if (n<=0)
// {
//   alert(`Степень ${n} не поддерживается, введите целую степень, большую 0`);
// }
// else
// {
//   alert(pow(x,n))
// }

// У меня Prettier форматирует код при сохранении, поэтому закомментировал функцию
// Недостатки следующие:
// 1. Отсутствие пробелов
// 2. Непонятные имена переменных (x, n)
// 3. Расположение фигурных скобок неодинаково в коде и в целом оба варианта, присутствующие в коде, мне кажутся плохо читаемыми
